announcements/training-wheels-for-xcape.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-04 Sat 10:05 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Training Wheels For Better Ergonomics</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Training Wheels For Better Ergonomics</h1>
<div id="outline-container-orgce001e1" class="outline-2">
<h2 id="orgce001e1"><span class="section-number-2">1.</span> Background</h2>
<div class="outline-text-2" id="text-1">
<p>
In my previous article <a href="https://emacspeak.blogspot.com/2023/02/enhance-emacs-ergonomics-under-x-happy.html">Ergonomics Using xcape</a>
I described my setup to minimize chording  in Emacs. The setup is
working whell, and in the few weeks of usage, I've reduce the <code>xcape
timeout</code> setting from 250ms to 170ms,  this is the timeout that
controls  the behavior of modifier keys in xcape.
</p>
</div>
</div>

<div id="outline-container-orgcdb9067" class="outline-2">
<h2 id="orgcdb9067"><span class="section-number-2">2.</span> Training Wheels In Emacs</h2>
<div class="outline-text-2" id="text-2">
<p>
Next, I decided that getting some feedback from Emacs and Emacspeak
 when xcape behavior is triggered would act as <i>training wheels</i> while
 getting used to the setup.
</p>

<p>
I considered the following:
</p>

<ol class="org-ol">
<li>Adding  a feature to <code>xcape</code> that produces a sound cue on triggering modified behavior &#x2014; would work <i>everywhere</i> in X.</li>
<li>Having Emacs produce some feedback when xcape behavior is triggered.</li>
<li>Asked on <span class="underline">emacs-devel</span> as to how one would do this in Emacsand
was pointed at <code>echo-keystrokes</code> by one of the core Emacs maintainers.</li>
</ol>
</div>
</div>

<div id="outline-container-org507b85d" class="outline-2">
<h2 id="org507b85d"><span class="section-number-2">3.</span> Solution</h2>
<div class="outline-text-2" id="text-3">
<p>
I phrased my question on emacs-devel as <i>is there an elisp hook</i> for
implementing this.  Turns out no new code is needed; Emacs has a
<code>echo-keystrokes</code> custom option that controls how long Emacs waits
before displaying an incomplete key-sequence.
</p>

<p>
So now, I have <code>echo-keystrokes</code> set to <span class="underline">0.05</span> &#x2014; and Emacspeak
speaks the resulting incomplete keystroke that  is displayed  by
Emacs. 
</p>

<p>
Still playing with various values of <code>echo-keystrokes</code> but that is
easy &#x2014; it's just one custom setting.
</p>
</div>
</div>

<div id="outline-container-orge94514c" class="outline-2">
<h2 id="orge94514c"><span class="section-number-2">4.</span> Conclusion</h2>
<div class="outline-text-2" id="text-4">
<p>
To quote <a href="https://en.wikipedia.org/wiki/Larry_Wall">Larry Wall</a> of Perl fame, 
</p>
<pre class="example">
Lazy programmer equals good programmer!
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-03-04 Sat 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2023-03-04 Sat 10:05</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>